Tekla Open API Reference for Tekla Structures 2025
MaterialMarketSizesItem.MarketSizes Property
 Available MarketSizes for the particular material
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double[] MarketSizes { get; }
Public ReadOnly Property MarketSizes As Double()
	Get
Property Value
Type: Double[]
See Also
Reference
MaterialMarketSizesItem Class
Tekla.Structures.Catalogs Namespace